#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cms_function_app.azurerm_storage_queue.request-activations-ingestion-retry will be created
  + resource "azurerm_storage_queue" "request-activations-ingestion-retry" {
      + id                   = (known after apply)
      + name                 = "request-activations-ingestion-retry"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnsvccmsst01"
    }

  # module.cms_function_app.azurerm_storage_queue.request-activations-ingestion-retry-poison will be created
  + resource "azurerm_storage_queue" "request-activations-ingestion-retry-poison" {
      + id                   = (known after apply)
      + name                 = "request-activations-ingestion-retry-poison"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnsvccmsst01"
    }

  # module.cms_function_app.module.cms_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "ACTIVATIONS_EVENT_HUB_NAME"                                                                       = "io-p-itn-svc-elt-activations-01"
          + "REQUEST_ACTIVATIONS_INGESTION_RETRY_QUEUE"                                                        = "request-activations-ingestion-retry"
            # (121 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-cms-func-01"
        name                                           = "io-p-itn-svc-cms-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Enti & Servizi"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cms_function_app.module.cms_fn.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "ACTIVATIONS_EVENT_HUB_NAME"                                                                       = "io-p-itn-svc-elt-activations-01"
          + "REQUEST_ACTIVATIONS_INGESTION_RETRY_QUEUE"                                                        = "request-activations-ingestion-retry"
            # (121 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-cms-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Enti & Servizi"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.eventhub.module.eventhub.azurerm_eventhub.events["io-p-itn-svc-elt-activations-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-svc-elt-activations-01"
      + namespace_name      = "io-p-itn-svc-elt-evhns-01"
      + partition_count     = 5
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-svc-rg-01"
      + status              = "Active"
    }

  # module.eventhub.module.eventhub.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-svc-elt-activations-01.io-p-itn-svc-cms-func-01"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-svc-elt-activations-01"
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "io-p-itn-svc-cms-func-01"
      + namespace_name                    = "io-p-itn-svc-elt-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-svc-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.eventhub.module.eventhub.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-svc-elt-activations-01.pdnd"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-svc-elt-activations-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "pdnd"
      + namespace_name                    = "io-p-itn-svc-elt-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-svc-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

Plan: 5 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.ai_search.module.srch_snet.azurerm_subnet.this,
  on .terraform/modules/ai_search.srch_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
